{
  "backend/main.mo": "Defines an empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing two UI-related features and the files, components, and test IDs associated with them.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files used in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for light and dark modes and applying global background and text styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component rendering Hero, Timeline, and Proposal sections with a footer.",
  "frontend/src/components/celebration/CelebrationEffect.tsx": "Generates falling hearts and warm-colored confetti particles with randomized animation properties.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with decorative warm gradient orbs, hearts, and styled headline text.",
  "frontend/src/components/sections/ProposalSection.tsx": "Interactive proposal UI with Yes/No buttons, moving No button logic, message cycling, and celebration animation trigger.",
  "frontend/src/components/sections/TimelineSection.tsx": "Timeline grid displaying relationship events with animated reveal on scroll.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refetching queries when identity changes.",
  "frontend/src/hooks/useHorizontalTimelineNav.ts": "Empty or missing file content; appears to be a placeholder for timeline navigation logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, managing AuthClient creation, identity state, and login status.",
  "frontend/src/hooks/useInView.ts": "Custom React hook using IntersectionObserver to detect when an element enters the viewport with optional threshold and one-time trigger.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables plus animations for theming, transitions, and decorative effects.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings with custom OKLCH palettes.",
  "project_state.json": "JSON document tracking project state, requirements, issues, and design notes for the Proposal Day website."
}