{
  "kind": "build_request",
  "title": "Fix timeline wording, improve hero/background styling, and reduce proposal button sizes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Update the Timeline milestone title text from “First time she came to my home” to exactly “First time you came to my home”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "First time she came to my home To First time you came to my home"
        ]
      },
      "acceptanceCriteria": [
        "In the Timeline section, the milestone currently titled “First time she came to my home” is changed to exactly “First time you came to my home”.",
        "No other timeline event titles, dates, or descriptions are modified."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Revise the website’s overall background color styling and improve the Hero (starting) section styling to look more impressive, while keeping the design clean, romantic, and avoiding blue/purple tones.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "background colour of while web and staring part of web i dont like make impressive"
        ]
      },
      "acceptanceCriteria": [
        "The global page background color (site-wide) is updated to a new cohesive warm/romantic background (no blue/purple hues).",
        "The Hero section visual presentation is noticeably improved (e.g., background treatment, decorative elements, typography polish) while keeping the existing content and single-page layout intact.",
        "The site remains responsive across mobile/tablet/desktop and retains readable contrast for all text."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Reduce the size of the “Yes” and “No” buttons in the Proposal section so they are no longer oversized, while preserving their current interactions/behavior (Yes triggers celebration; No shows escalating messages and moves after a few clicks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes and no btuon was toobig so change this also"
        ]
      },
      "acceptanceCriteria": [
        "The Proposal section “Yes” and “No” buttons are smaller than the current implementation (reduced padding and/or font size) on both mobile and desktop.",
        "Button labels remain in English and unchanged (including existing punctuation/emojis if present).",
        "All existing Proposal interactions continue to work: Yes triggers the celebration message and effect; No advances messages and begins moving after the configured number of clicks.",
        "The “No” button still does not overlap the “Yes” button and stays fully visible within its container while moving."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the app as a single-page site with the existing three sections (Hero, Timeline, Proposal).",
    "Avoid blue/purple tones in the updated background/hero styling and keep a romantic, clean look."
  ],
  "nonGoals": [
    "Do not add new timeline events or change event ordering.",
    "Do not change the proposal text content or the celebration quote text.",
    "No backend changes (Motoko) are required."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}