{
  "kind": "build_request",
  "title": "Proposal section: put Yes/No buttons on the same line and add the provided romantic poem",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Update the Proposal section so the “Yes” and “No” buttons are displayed side-by-side on the same line in a single centered buttons row, while preserving all current button behaviors (Yes triggers celebration; No cycles messages and eventually moves).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In this yes and no btutton beside same line both btn make samll"
        ]
      },
      "acceptanceCriteria": [
        "On initial render (before the No button starts moving), the Yes and No buttons appear in one centered horizontal row with consistent spacing.",
        "Both buttons are visibly smaller than the current styling and not oversized on mobile or desktop (no text wrapping inside the buttons).",
        "All existing interactions remain unchanged: Yes triggers the same celebration message and effects; No still advances the message sequence and begins moving after the same number of clicks.",
        "The No button must never overlap or cover the Yes button at any time, including after it becomes absolutely positioned and moves."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add the user-provided romantic poem lines to the Proposal section UI and style them so they look polished and readable within the section (no overlap with the headline, messages, or buttons).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "also add this one\n\nकी बताने की बात तो नहीं है पर बताने दोगी क्या ?\nइश्क़ बेपनाह हैं तुमसे\nएक बार जताने दोगी क्या\nऔर तुम नदी, तुम पहाड़, तुम तितली, तुम आसमान हो मेरा\nएक डिबिया में सिंदूर रखा है हमारे पास तुम...\nलगाने दोगी क्या ?"
        ]
      },
      "acceptanceCriteria": [
        "The poem is rendered in the Proposal section as multi-line text with intentional line breaks and good spacing.",
        "The poem text is displayed exactly as provided by the user (same characters and punctuation).",
        "The poem remains readable on small screens (no clipping/overlap) and does not interfere with the No-message area or the buttons row layout.",
        "When the celebration view is shown (after clicking Yes), the poem does not cause layout overlap with the celebration message/effect."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui (compose existing UI components instead).",
    "Preserve existing Proposal section interactions: No-message sequence, No-button movement logic, and Yes celebration behavior/effects.",
    "Keep the site’s romantic theme and continue avoiding blue/purple tones in UI styling."
  ],
  "nonGoals": [
    "Do not change the proposal headline text or the existing celebration message text.",
    "Do not add new buttons or new proposal interactions beyond layout/styling and adding the poem content.",
    "No backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}