{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Proposal section layout polish: inline buttons + romantic poem",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Display “Yes” and “No” buttons side-by-side in a single centered row with smaller sizing, while preserving all existing behaviors and preventing overlap when No moves.",
      "acceptanceCriteria": [
        "On initial render (before the No button starts moving), the Yes and No buttons appear in one centered horizontal row with consistent spacing.",
        "Both buttons are visibly smaller than the current styling and not oversized on mobile or desktop (no text wrapping inside the buttons).",
        "All existing interactions remain unchanged: Yes triggers the same celebration message and effects; No still advances the message sequence and begins moving after the same number of clicks.",
        "The No button must never overlap or cover the Yes button at any time, including after it becomes absolutely positioned and moves."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProposalSection.tsx",
          "operation": "modify",
          "description": "Restructure the Proposal section buttons area into one centered horizontal row that contains both buttons on initial render. Keep the existing click handlers and the existing No-message + No-movement logic intact, but adjust layout so the No button can become absolutely positioned within a shared play area without ever overlapping the Yes button. Reduce both buttons’ visual size (typography + padding/height) and enforce no-wrapping text. Use the shadcn-ui Button component (compose only; do not modify UI component files). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Render the user-provided romantic poem lines in the Proposal section with polished, readable styling and safe spacing across normal and celebration states.",
      "acceptanceCriteria": [
        "The poem is rendered in the Proposal section as multi-line text with intentional line breaks and good spacing.",
        "The poem text is displayed exactly as provided by the user (same characters and punctuation).",
        "The poem remains readable on small screens (no clipping/overlap) and does not interfere with the No-message area or the buttons row layout.",
        "When the celebration view is shown (after clicking Yes), the poem does not cause layout overlap with the celebration message/effect."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProposalSection.tsx",
          "operation": "modify",
          "description": "Add a dedicated poem block within the Proposal section that renders the provided Hindi poem text exactly as given, preserving line breaks (e.g., via pre-line whitespace handling) and applying warm, romantic, readable typography (no blue/purple tones). Ensure the poem’s spacing does not collide with the headline, No-message area, or the centered buttons row, and that the celebration state layout remains clear with no overlap against the celebration message/effect. Use existing styling utilities and compose existing shadcn-ui primitives only (e.g., Button remains composed, not edited). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}