{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Timeline wording fix, warmer hero/background styling, and smaller proposal buttons",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Change the specified Timeline milestone title text to the exact requested wording without altering any other timeline content.",
      "acceptanceCriteria": [
        "In the Timeline section, the milestone currently titled “First time she came to my home” is changed to exactly “First time you came to my home”.",
        "No other timeline event titles, dates, or descriptions are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/TimelineSection.tsx",
          "operation": "modify",
          "description": "Update only the single matching event title string in the timeline events list from “First time she came to my home” to exactly “First time you came to my home”, leaving all other event fields unchanged."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Update site-wide background styling and enhance the Hero section visuals with a clean romantic warm palette (no blue/purple), keeping content and single-page layout intact.",
      "acceptanceCriteria": [
        "The global page background color (site-wide) is updated to a new cohesive warm/romantic background (no blue/purple hues).",
        "The Hero section visual presentation is noticeably improved (e.g., background treatment, decorative elements, typography polish) while keeping the existing content and single-page layout intact.",
        "The site remains responsive across mobile/tablet/desktop and retains readable contrast for all text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Revise global background styling by adjusting the warm background tokens and/or adding a subtle warm romantic background treatment at the body level (e.g., gentle cream/peach/coral gradients or texture) while maintaining readable contrast and avoiding any blue/purple hues."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Improve Hero section styling (keeping the same text/content) by enhancing background decoration and typography polish (e.g., richer warm gradient treatments, refined blob/ornament placement, improved spacing) to look more impressive while remaining clean, romantic, and responsive."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Reduce the visual size of the Proposal Yes/No buttons while preserving all existing interactions and ensuring the moving No button stays visible and non-overlapping.",
      "acceptanceCriteria": [
        "The Proposal section “Yes” and “No” buttons are smaller than the current implementation (reduced padding and/or font size) on both mobile and desktop.",
        "Button labels remain in English and unchanged (including existing punctuation/emojis if present).",
        "All existing Proposal interactions continue to work: Yes triggers the celebration message and effect; No advances messages and begins moving after the configured number of clicks.",
        "The “No” button still does not overlap the “Yes” button and stays fully visible within its container while moving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProposalSection.tsx",
          "operation": "modify",
          "description": "Use the shadcn-ui Button component to reduce the Yes/No button sizing (adjust size prop and/or Tailwind classes for font size/padding/hover scale) while keeping labels unchanged and preserving the existing click/move logic; verify the component's usage instructions before implementing. Also confirm the No button’s play area and movement bounds still keep it fully visible and not overlapping the Yes button across responsive breakpoints."
        }
      ]
    }
  ]
}