{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Polished, self-explanatory horizontal Timeline UX",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Make the horizontal timeline instantly understandable as horizontally scrollable and improve date readability while keeping the section compact and romantic.",
      "acceptanceCriteria": [
        "Timeline clearly communicates horizontal navigation via at least two visual affordances (e.g., subtle left/right edge fades, an inline hint text like “Scroll to explore →”, visible drag/scroll indicator, or arrow controls).",
        "Each timeline card’s date is visually distinct (font weight/size/contrast) and remains easy to scan on mobile and desktop.",
        "No user-facing text added for guidance uses non-English language (all guidance/hints must be English).",
        "Horizontal timeline remains shorter than an equivalent vertical list and does not introduce long vertical scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/TimelineSection.tsx",
          "operation": "modify",
          "description": "Update the Timeline section UI to clearly signal horizontal scrolling using multiple affordances: add subtle left/right edge fade overlays, add an English inline hint (e.g., “Scroll to explore →”) placed above/within the timeline container, and ensure the hint is non-intrusive (can fade out after first interaction). Improve date styling (more prominent weight/size/contrast, tabular numerals) without changing any event strings, ordering, or reveal animation behavior; keep the overall section height compact and romantic (no blue/purple tones)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add small reusable utilities for the Timeline section presentation (e.g., a no-scrollbar utility for horizontal scrollers, and/or subtle mask/fade helpers) using the existing warm palette and avoiding blue/purple tones. Ensure utilities support compact layout and do not alter event content."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add optional navigation helpers (snap-to-card and/or left-right controls) so browsing timeline items feels smooth on desktop and mobile.",
      "acceptanceCriteria": [
        "Users can reliably move through timeline items without precision scrolling on both trackpad/mouse and touch (mobile).",
        "If snap behavior is implemented, the scroll position settles cleanly on a card boundary (no awkward half-visible cards after interaction).",
        "Any added controls do not overlap timeline content and remain accessible on small screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useHorizontalTimelineNav.ts",
          "operation": "create",
          "description": "Create a small hook to support horizontal timeline navigation helpers (e.g., container ref wiring, canScrollLeft/canScrollRight state, and functions to scroll one card at a time and/or to the nearest snap point). Use this hook from the Timeline section to keep logic isolated."
        },
        {
          "path": "frontend/src/components/sections/TimelineSection.tsx",
          "operation": "modify",
          "description": "Implement optional navigation helpers for the horizontal timeline: enable clean snap-to-card behavior (scroll-snap) and add left/right controls that scroll by one card increment without overlapping content (positioned outside/above the scroller on small screens as needed). Ensure controls are accessible (keyboard/focus states, aria-labels) and work well with mouse/trackpad and touch."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Polish Timeline visuals to feel cleaner and more premium while preserving existing events, card layout, and reveal animation style.",
      "acceptanceCriteria": [
        "All existing timeline events (date, title, 1-line description) remain unchanged and in the same order as currently implemented.",
        "Existing entrance/reveal animation behavior remains (items animate in as they come into view), but the overall timeline looks more cohesive (spacing, alignment, and decorative line/dots feel intentional).",
        "Design continues to avoid blue/purple tones for timeline UI elements."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/TimelineSection.tsx",
          "operation": "modify",
          "description": "Refine Timeline visuals for a premium, cohesive look: tune spacing, alignment, shadows, borders, and decorative line/dot treatment while keeping the same card structure and the existing in-view reveal animation. Maintain the warm romantic palette (no blue/purple), and keep all milestone content and ordering exactly as-is."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/add any minimal global animation or typography utilities needed to support the refined Timeline presentation (e.g., subtle shadow/outline consistency or motion-reduce fallbacks) while preserving the existing reveal animation style and avoiding blue/purple tones."
        }
      ]
    }
  ]
}